<template>
<v-container fluid>
    <v-row no-gutters justify="center" v-if="!getBadVision">
        <v-col cols="12" lg="10" md="12">
            <div class="text-center display-2">Поздравляем с Днем соцработника 2020!</div>
        </v-col>
    </v-row>
    <v-row no-gutters justify="center" v-if="!getBadVision">
        <v-col cols="12" lg="5" md="6" sm="12" class="mb-2 mt-2">
            <v-card class="pa-4" height="100%">
            <p class="text-center headline">Наши рабочие будни</p>
                <v-carousel hide-delimiter-background hide-delimiters :show-arrows="false" cycle light>
                    <v-carousel-item reverse-transition="fade-transition" transition="fade-transition">
                       <v-card flat>
                           <v-img src="../../assets/photo/1.jpg"></v-img>
                           <v-card-subtitle class="black--text title">Отдел опеки и попечительства</v-card-subtitle>
                       </v-card>
                    </v-carousel-item>
                    <v-carousel-item reverse-transition="fade-transition" transition="fade-transition">
                       <v-card flat>
                           <v-img src="../../assets/photo/2.jpg"></v-img>
                           <v-card-subtitle class="black--text title">Отдел выплат</v-card-subtitle>
                       </v-card>
                    </v-carousel-item>
                    <v-carousel-item reverse-transition="fade-transition" transition="fade-transition">
                       <v-card flat>
                           <v-img src="../../assets/photo/3.jpg"></v-img>
                           <v-card-subtitle class="black--text title">Отдел по делам семьи, назначения пособий и компенсаций</v-card-subtitle>
                       </v-card>
                    </v-carousel-item>
                    <v-carousel-item reverse-transition="fade-transition" transition="fade-transition">
                       <v-card flat>
                           <v-img src="../../assets/photo/4.jpg"></v-img>
                           <v-card-subtitle class="black--text title">Отдел социальной поддержки ветеранов и инвалидов</v-card-subtitle>
                       </v-card>
                    </v-carousel-item>
                    <v-carousel-item reverse-transition="fade-transition" transition="fade-transition">
                       <v-card flat>
                           <v-img src="../../assets/photo/5.jpg"></v-img>
                           <v-card-subtitle class="black--text title">Отдел учета и предоставления социальных гарантий и льгот</v-card-subtitle>
                       </v-card>
                    </v-carousel-item>
                    <v-carousel-item reverse-transition="fade-transition" transition="fade-transition">
                       <v-card flat>
                           <v-img src="../../assets/photo/6.jpg"></v-img>
                           <v-card-subtitle class="black--text title">Отдел субсидии</v-card-subtitle>
                       </v-card>
                    </v-carousel-item>
                </v-carousel>
            </v-card>
        </v-col>
        <v-col cols="12" lg="5" md="6" sm="12" class="mb-2 mt-2">
            <v-card class="ml-md-2 pa-4" height="100%">
                <p class="text-center headline">Поздравление начальника УСЗН</p>
                <span><p style="text-align: center;">Уважаемые работники</p><p style="text-align: justify;">Управления социальной защиты населения, МУ &laquo;Комплексный центр&raquo;, МУ &laquo;Дом-интернат для умственно отсталых детей&raquo;, МУ &laquo;Дом-интернат для престарелых и инвалидов&raquo;, МУ &laquo;Центр помощи детям-сиротам и детям, оставшимся без попечения родителей&raquo;!</p><p style="text-align: center;">Дорогие коллеги!</p><p style="text-align: justify;">Примите искренние поздравления с профессиональным праздником &mdash; Днем социального работника! В нашей сфере трудятся люди с повышенным чувством ответственности, отдающие работе свою энергию, терпение и душевные силы. Вы являетесь опорой для тех, кто оказался в трудной жизненной ситуации и порой потерял веру в себя. Вы успешно справляетесь с любыми поставленными перед вами задачами. В этот праздничный день примите искреннюю благодарность за ваш нелегкий труд. Благодаря вам, дети, оставшиеся без родительского тепла, обретают семьи, ветераны окружены заботой и вниманием. Желаю всем вам и вашим семьям здоровья, душевного спокойствия и благополучия! И никогда не сомневайтесь в правильности вашего выбора - служении ближнему!</p><p>Начальник Управления социальной защиты населения</p><p><strong>Солодовникова Л.В.</strong></p></span>
            </v-card>
        </v-col>
    </v-row>
    <v-row no-gutters justify="center" v-if="!getBadVision">
      <v-col cols="12" lg="10" md="12">
        <v-card class="pa-3">
          <div class="text-center"><span class="headline">УСЗН в цифрах 2019-2020</span></div>
          <span class="ma-2"><p>В настоящее время, на территории Озерского городского округа проживает 30 416 граждан пенсионного возраста, 4 663 инвалида, 380 детей-инвалидов, более 1 500 малоимущих семей, воспитывающих более 2 500 детей.</p><p>В 2019 году расходы на социальную поддержку граждан Озерского городского округа составили более 560,0 миллионов рублей из бюджетов всех уровней. Более 40&nbsp;535 граждан получили различные компенсации и государственные услуги.</p><p>Приоритетными направлениями деятельности социальной сферы являются:</p><p>- поддержка семей с детьми;</p><p>- улучшение качества жизни граждан пожилого возраста и инвалидов.</p>
          <p>Особое внимание уделяется выпускникам МБУСО &laquo;Центр помощи детям-сиротам и детям, оставшимся без попечения родителей&raquo;. В рамках постинтернатного сопровождения оказывается поддержка 100% выпускников в зависимости от их потребностей.</p><p>В 2019 году приобретено 10 квартир для детей-сирот и детей, оставшихся без попечения родителей.</p><p>&nbsp; В семье живут не только дети, но и представители старшего поколения, а также люди с ограниченными возможностями здоровья, которые тоже нуждаются в помощи и постоянном внимании.</p>
          <p>Учреждения с круглосуточным проживанием, оказывают 82 социальные услуги, гарантируемые государством и соответствующие государственным стандартам. За 2019 год 1&nbsp;883 человека получили социальные услуги. Общая сумма выделенных средств областного бюджета на предоставление социальных услуг гражданам Озерского городского округа составила более 96,0 млн. рублей.</p><p>Нашими Учреждениями социальной сферы достигнуты определенные успехи, есть и задачи, которые совместными усилиями будут решаться, чтобы реально помочь человеку.</p>
          </span>
            <span class="hidden-md-and-up" style="text-align: justify;">
              <span>За 2019 год семьям с детьми:</span>
              <p>- выплачено различных видов пособий, льгот и компенсаций на сумму более 71,&nbsp;0 млн. рублей;<br /> - вручено 556 подарочных комплектов для новорожденных детей;<br /> - получено единовременное материальное пособие на подготовку детей из многодетных семей к школе в размере 1&nbsp;500 рублей на каждого ребенка (117 семей 260 детей);<br /> - получена материальная помощь (128 семей);<br /> - выделено 2&nbsp;600 новогодних подарка, приобретено 34 специализированных новогодних подарка для детей с определенными видами заболеваний;<br /> - получили лечение и отдохнули в лагерях и санаториях Челябинской области 129 детей;<br /> - выделено 44 подарка к Международному дню защиты детей для ребят, находящихся в трудной жизненной ситуации.</p>
                  <span>В 2019 году гражданам Озерского городского округа:</span>
                  <p>Предоставлено различных мер социальной поддержки на сумму более 383,0 млн. рублей, в том числе инвалидам, участникам ВОВ, ветеранам труда, жертвам политических репрессий, сельским специалистам, гражданам, подвергшимся воздействию радиации, почетным донорам России и другим льготным категориям.</p><p>Единовременную выплату к Дню пожилого человека получили 24 736 человек на общую сумму 17&nbsp;315,200 тысяч рублей.</p><p>Внимание уделяется доступной среде Озерского городского округа для инвалидов и других маломобильных групп населения. Актуализирован Реестр социально значимых объектов округа, разработана и утверждена муниципальная программа &laquo;Доступная среда&raquo;.</p>
                  <span>В 2020 году отмечается 75-я годовщина Победы в Великой Отечественной войне:</span>
                  <p>- проведено 6 торжественных мероприятий для ветеранов Великой Отечественной войны;<br /> - вручено 607 Юбилейных медалей и 723 поздравительных открыток от имени Губернатора Челябинской области;<br /> - вручено 39 продуктовых наборов к Дню Победы;<br /> - произведены выплаты 403 ветеранам ВОВ к Дню Победы;<br /> - запланирована установка 6 надгробных памятников ветеранам ВОВ;<br /> - выделено 320,000 тысяч рублей на ремонт жилья, подводку к дому газопровода и установку газового оборудования для 8 человек по 40,000 тысяч рублей каждому;<br /> - проведено обследование 2&nbsp;228 ветеранов, с целью изучения их социально-экономического положения, оказания всесторонней помощи.</p>
            </span>
            <v-timeline class="hidden-sm-and-down">
              <v-timeline-item color="blue-grey" small> 
                <template v-slot:opposite>
                  <span>За 2019 год семьям с детьми:</span>
                </template>
                <v-card class="elevation-4">
                  <v-card-text><p>- выплачено различных видов пособий, льгот и компенсаций на сумму более 71,&nbsp;0 млн. рублей;<br /> - вручено 556 подарочных комплектов для новорожденных детей;<br /> - получено единовременное материальное пособие на подготовку детей из многодетных семей к школе в размере 1&nbsp;500 рублей на каждого ребенка (117 семей 260 детей);<br /> - получена материальная помощь (128 семей);<br /> - выделено 2&nbsp;600 новогодних подарка, приобретено 34 специализированных новогодних подарка для детей с определенными видами заболеваний;<br /> - получили лечение и отдохнули в лагерях и санаториях Челябинской области 129 детей;<br /> - выделено 44 подарка к Международному дню защиты детей для ребят, находящихся в трудной жизненной ситуации.</p></v-card-text>
                </v-card>
              </v-timeline-item>
              <v-timeline-item color="blue-grey" small> 
                <template v-slot:opposite>
                  <span>В 2019 году гражданам Озерского городского округа:</span>
                </template>
                <v-card class="elevation-4">
                  <v-card-text><p>Предоставлено различных мер социальной поддержки на сумму более 383,0 млн. рублей, в том числе инвалидам, участникам ВОВ, ветеранам труда, жертвам политических репрессий, сельским специалистам, гражданам, подвергшимся воздействию радиации, почетным донорам России и другим льготным категориям.</p><p>Единовременную выплату к Дню пожилого человека получили 24 736 человек на общую сумму 17&nbsp;315,200 тысяч рублей.</p><p>Внимание уделяется доступной среде Озерского городского округа для инвалидов и других маломобильных групп населения. Актуализирован Реестр социально значимых объектов округа, разработана и утверждена муниципальная программа &laquo;Доступная среда&raquo;.</p></v-card-text>
                </v-card>
              </v-timeline-item>
              <v-timeline-item color="blue-grey" small> 
                <template v-slot:opposite>
                  <span>В 2020 году отмечается 75-я годовщина Победы в Великой Отечественной войне:</span>
                </template>
                <v-card class="elevation-4">
                  <v-card-text><p>- проведено 6 торжественных мероприятий для ветеранов Великой Отечественной войны;<br /> - вручено 607 Юбилейных медалей и 723 поздравительных открыток от имени Губернатора Челябинской области;<br /> - вручено 39 продуктовых наборов к Дню Победы;<br /> - произведены выплаты 403 ветеранам ВОВ к Дню Победы;<br /> - запланирована установка 6 надгробных памятников ветеранам ВОВ;<br /> - выделено 320,000 тысяч рублей на ремонт жилья, подводку к дому газопровода и установку газового оборудования для 8 человек по 40,000 тысяч рублей каждому;<br /> - проведено обследование 2&nbsp;228 ветеранов, с целью изучения их социально-экономического положения, оказания всесторонней помощи.</p></v-card-text>
                </v-card>
              </v-timeline-item>
            </v-timeline>
        </v-card>
      </v-col>
    </v-row>

    <v-row no-gutters justify="center" v-if="getBadVision">
      <v-col>
        <span v-bind:class="{'hide' : !getBvParams.bvImages, 'body-2' : getBvParams.bvFont == 'small', 'body-1' : getBvParams.bvFont == 'medium', 'title' : getBvParams.bvFont == 'large'}">
        <p style="text-align: center;">Уважаемые работники</p><p style="text-align: center;">Управления социальной защиты населения, МУ &laquo;Комплексный центр&raquo;, МУ &laquo;Дом-интернат для умственно отсталых детей&raquo;, МУ &laquo;Дом-интернат для престарелых и инвалидов&raquo;, МУ &laquo;Центр помощи детям-сиротам и детям, оставшимся без попечения родителей&raquo;!</p><p style="text-align: center;">Дорогие коллеги!</p><p style="text-align: justify;">Примите искренние поздравления с профессиональным праздником &mdash; Днем социального работника! В нашей сфере трудятся люди с повышенным чувством ответственности, отдающие работе свою энергию, терпение и душевные силы. Вы являетесь опорой для тех, кто оказался в трудной жизненной ситуации и порой потерял веру в себя. Вы успешно справляетесь с любыми поставленными перед вами задачами. В этот праздничный день примите искреннюю благодарность за ваш нелегкий труд. Благодаря вам, дети, оставшиеся без родительского тепла, обретают семьи, ветераны окружены заботой и вниманием.&nbsp;</p><p style="text-align: justify;">Желаю всем вам и вашим семьям здоровья, душевного спокойствия и благополучия! И никогда не сомневайтесь в правильности вашего выбора -&nbsp; служении ближнему!</p><p>Начальник Управления социальной защиты населения</p><p><strong>Солодовникова Л.В.</strong></p>
        <p style="text-align: center;"><strong>Наши достижения</strong></p><p>&nbsp;В настоящее время, на территории Озерского городского округа проживает 30 416 граждан пенсионного возраста, 4 663 инвалида, 380 детей-инвалидов, более 1 500 малоимущих семей, воспитывающих более 2 500 детей.</p><p>В 2019 году расходы на социальную поддержку граждан Озерского городского округа составили более 560,0 миллионов рублей из бюджетов всех уровней. Более 40&nbsp;535 граждан получили различные компенсации и государственные услуги.</p><p>Приоритетными направлениями деятельности социальной сферы являются:</p><p>- поддержка семей с детьми;</p><p>- улучшение качества жизни граждан пожилого возраста и инвалидов.</p><p>За 2019 год семьям с детьми:</p><p>- выплачено различных видов пособий, льгот и компенсаций на сумму более 71,&nbsp;0 млн. рублей;&nbsp;</p><p>- вручено 556 подарочных комплектов для новорожденных детей;</p><p>- получено единовременное материальное пособие на подготовку детей из многодетных семей к школе в размере 1&nbsp;500 рублей на каждого ребенка (117 семей 260 детей);</p><p>- получена материальная помощь (128 семей);</p><p>- выделено 2&nbsp;600 новогодних подарка, приобретено 34 специализированных новогодних подарка для детей с определенными видами заболеваний;</p><p>- получили лечение и отдохнули в лагерях и санаториях Челябинской области 129 детей;</p><p>- выделено 44 подарка к Международному дню защиты детей для ребят, находящихся в трудной жизненной ситуации.</p><p>Все это традиционные мероприятия, но каждое из них очень важно для тех, кто нуждается в поддержке со стороны государства.</p><p>Учреждениями социальной сферы делается акцент на то, чтобы семья появилась у всех, кто в ней нуждается, поэтому продолжена работа по устройству детей в семьи граждан, введению дополнительных мер поддержки замещающих семей.</p><p>Особое внимание уделяется выпускникам МБУСО &laquo;Центр помощи детям-сиротам и детям, оставшимся без попечения родителей&raquo;. В рамках постинтернатного сопровождения оказывается поддержка 100% выпускников в зависимости от их потребностей.</p><p>В 2019 году приобретено 10 квартир для детей-сирот и детей, оставшихся без попечения родителей.</p><p>&nbsp; В семье живут не только дети, но и представители старшего поколения, а также люди с ограниченными возможностями здоровья, которые тоже нуждаются в помощи и постоянном внимании.</p><p>&nbsp; В 2019 году гражданам Озерского городского округа предоставлено различных мер социальной поддержки на сумму более 383,0 млн. рублей, в том числе инвалидам, участникам ВОВ, ветеранам труда, жертвам политических репрессий, сельским специалистам, гражданам, подвергшимся воздействию радиации, почетным донорам России и другим льготным категориям.</p><p>&nbsp; &nbsp; Единовременную выплату к Дню пожилого человека получили 24 736 человек на общую сумму 17&nbsp;315,200 тысяч рублей.</p><p>Внимание уделяется доступной среде Озерского городского округа для инвалидов и других маломобильных групп населения. Актуализирован Реестр социально значимых объектов округа, разработана и утверждена муниципальная программа &laquo;Доступная среда&raquo;.</p><p>В период действия режима повышенной готовности на территории Челябинской области организована совместная работа с волонтерами, в результате которой доставлены продовольственные наборы:</p><p>- 1 050 гражданам старше 70 лет, имеющим инвалидность;</p><p>-&nbsp; 94 семьям, имеющим детей-инвалидов;</p><p>- 288 многодетным семьям.</p><p>Всего на &laquo;горячую линию&raquo; поступило 1&nbsp;468 звонков от граждан старше 65 лет, из них оказано консультаций 1&nbsp;052 гражданам, выполнено 416 заявок граждан.</p><p>&nbsp; В 2020 году отмечается 75-я годовщина Победы в Великой Отечественной войне:</p><p>&nbsp; - проведено 6 торжественных мероприятий для ветеранов Великой Отечественной войны.</p><p>&nbsp; - вручено 607 Юбилейных медалей и 723 поздравительных открыток от имени Губернатора Челябинской области;</p><p>&nbsp; - вручено 39 продуктовых наборов к Дню Победы;</p><p>&nbsp; - произведены выплаты 403 ветеранам ВОВ к Дню Победы;</p><p>&nbsp; - запланирована установка 6 надгробных памятников ветеранам ВОВ;</p><p>&nbsp; - выделено 320,000 тысяч рублей на ремонт жилья, подводку к дому газопровода и установку газового оборудования для 8 человек по 40,000 тысяч рублей каждому;</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - проведено обследование 2&nbsp;228 ветеранов, с целью изучения их социально-экономического положения, оказания всесторонней помощи.</p><p>Учреждения с круглосуточным проживанием, оказывают 82 социальные услуги, гарантируемые государством и соответствующие государственным стандартам. За 2019 год 1&nbsp;883 человека получили социальные услуги. Общая сумма выделенных средств областного бюджета на предоставление социальных услуг гражданам Озерского городского округа составила более 96,0 млн. рублей.</p><p>&nbsp;&nbsp;&nbsp;&nbsp; Нашими Учреждениями социальной сферы достигнуты определенные успехи, есть и задачи, которые совместными усилиями будут решаться, чтобы реально помочь человеку.</p>
        </span>
      </v-col>
    </v-row>
</v-container>    
</template>

<script>

import {mapGetters} from 'vuex';
export default {
computed: {
  ...mapGetters(['getBadVision', 'getBvParams']),
}
  
}
</script>
