<template>
<v-carousel cycle show-arrows-on-hover hide-delimiters light height="100%">
<v-carousel-item v-for="element in carousel" :key="element.id">
<v-row no-gutters>
    <v-col cols="12" lg="4" sm="12" v-for="info in element.infoblock" :key="info.id">
        <v-card class="ma-1 d-flex flex-row">
            <v-card min-width="50%" max-width="50%" flat>
            <v-img class="align-end" aspect-ratio="0.7" :alt="info.alt" :src="require('../../assets/photo/childs/' + info.img)"/>
            </v-card>
            <v-card flat>
                <v-card-text><p><b>{{info.name}}</b></p><p>{{ info.text }}</p></v-card-text>
            </v-card>
        </v-card>
    </v-col>
</v-row>
</v-carousel-item>
</v-carousel>
</template>

<script>
export default {
    data() {
        return {
            carousel: [
                {
                    id: 1,
                    infoblock: [
                        {
                          id: 1,
                          img: "Vyacheslav.png",
                          name: "Вячеслав, 2016 г.р. (брат Савелия, 2014 г.р.)",
                          text: "Доброжелательный, любопытный, общительный, трудолюбивый, подвижный, исполнительный мальчик. Любит мастерить поделки, рисовать, играть в настольные игры. Хороший помощник.  Принимает активное участие во всех мероприятиях. С удовольствием катается на велосипеде, играет в футбол."  
                        },
                        {
                          id: 2,
                          img: "Saveliy.png",
                          name: "Савелий, 2014 г.р., (брат Вячеслава, 2016 г.р.)",
                          text: "Савелий готовится к школе, обладает способностью быстро усваивать информацию. По характеру активный, доброжелательный. Поручения выполняет охотно.  Легко находит контакт с детьми любого возраста и взрослыми."  
                        },
                        {
                          id: 3,
                          img: "Kirill1.png",
                          name: "Кирилл, 2009 г.р.",
                          text: "Спокойный, добрый, отзывчивый мальчик дружелюбен со сверстниками и взрослыми, немного стеснительный; занимается в кружке прикладного творчества в Центре, любит делать поделки, рисовать, увлекается настольными играми."  
                        },
                    ]
                },
                {
                    id: 2,
                    infoblock: [
                        {
                          id: 1,
                          img: "Maksim.png",
                          name: "Максим, 2011 г.р. (брат Степана, 2008 г.р.)",
                          text: "Общительный, любопытный, доброжелательный, трудолюбивый, подвижный, исполнительный мальчик; хороший помощник. любит мастерить поделки, рисовать, играть в настольные игры; принимает активное участие во всех мероприятиях Центра."  
                        },
                        {
                          id: 2,
                          img: "Stepan.png",
                          name: "Степан, 2008 г.р. (брат Максима, 2011 г.р.)",
                          text: "Спокойный, доброжелательный, дружелюбен со сверстниками и взрослыми; занимается творчеством в кружке рукоделия, рисует, любит спортивные игры; принимает активное участие во всех мероприятиях Центра, помогает по-хозяйству."  
                        },
                        {
                          id: 3,
                          img: "Yaroslav.png",
                          name: "Ярослав, 2009 г.р.",
                          text: "Спокойный мальчик, доброжелательный, дружелюбен со сверстниками и взрослыми, любит играть в спортивные игры, рисовать; любит помогать по-хозяйству и на огороде; принимает активное участие во всех мероприятиях Центра."  
                        },
                    ]
                },
                {
                    id: 3,
                    infoblock: [
                        {
                          id: 1,
                          img: "Vladislav.png",
                          name: "Владислав, 2004 г.р.",
                          text: "Серьезный, самостоятельный, ответственный, к учебе относится добросовестно, трудолюбивый, дружелюбный, общительный, имеет много друзей. Занимается спортом, всегда доводить начатое дело до конца."  
                        },
                        {
                          id: 2,
                          img: "Trofim.png",
                          name: "Трофим, 2008 г.р.",
                          text: "Активный, доброжелательный, коммуникабельный, с удовольствием помогает младшим, охотно выполняет поручения; имеет хорошие способности к учебе, быстро усваивать информацию, обладает способностью целенаправленно трудиться, на замечания реагирует адекватно."  
                        },
                        {
                          id: 3,
                          img: "Nikolay.png",
                          name: "Николай, 2005 г.р.",
                          text: "Коммуникабельный, веселый, доброжелательный, ответственный, самоконтроль на высоком уровне, любит порядок, соблюдает правила; увлекается футболом, хоккеем, компьютерными играми; имеет навыки актерского мастерства; участвовать во всех мероприятиях Центра. "  
                        },
                    ]
                },
                {
                    id: 4,
                    infoblock: [
                        {
                          id: 1,
                          img: "Kirill2.png",
                          name: "Кирилл, 2006 г.р.",
                          text: "Мечтательный, коммуникабельный, миролюбивый, доверчивый, вежливый в общении с детьми и взрослыми; любит играть в футбол, катается на велосипеде, на конька; способен выражать в речи свои мысли и желания; интересуется космосом. "  
                        },
                        {
                          id: 2,
                          img: "Sergey.png",
                          name: "Сергей, 2004 г.р.",
                          text: "Подвижный, общительный, любознательный. Успешно справляется со школьной программой, любит рисовать, играть в спортивные игры. Дружелюбен со сверстниками. К взрослым относится с уважением, любит помогать по хозяйству."  
                        },
                        {
                          id: 3,
                          img: "Sneganna.png",
                          name: "Снежанна, 2004 г.р.",
                          text: "Дружелюбная, отзывчивая, уравновешенная девочка, умеет отстаивать собственное мнение,  кругозор сформирован на бытовом уровне; увлекается рукоделием, активно участвует в творческих мероприятиях; поручения выполняет аккуратно, добросовестно с инициативой и вовремя. "  
                        },
                    ]
                },
                {
                    id: 5,
                    infoblock: [
                        {
                          id: 1,
                          img: "Alexander.png",
                          name: "Александр, 2006 г.р.",
                          text: "Добрый, застенчивый мальчик. Любит рисовать, играть в настольные игры, помогать взрослым. С удовольствием играет в футбол, хоккей, посещает занятия по прикладному творчеству."  
                        },
                        {
                          id: 2,
                          img: "Valeriya.png",
                          name: "Валерия, 2005 г.р.",
                          text: "Спокойная, любознательная, общительная, не конфликтная. Хорошо учится, любит читать книги, хорошо рисует, декламирует стихи, занимается в хоровой студии. Помогает ухаживать за младшими воспитанниками."  
                        },
                        {
                          id: 3,
                          img: "Viktoriya.png",
                          name: "Виктория, 2005 г.р.",
                          text: "Подвижная, веселая, общительная. На контакт идет легко, со взрослыми разговаривает вежливо, со сверстниками не конфликтует, коммуникабельная."  
                        },
                    ]
                },
                {
                    id: 6,
                    infoblock: [
                        {
                          id: 1,
                          img: "Georgiy.png",
                          name: "Георгий, 2005 г.р.",
                          text: "Самостоятельный, исполнительный, обладает лидерскими качествами, легко устанавливает контакт со взрослыми и с детьми, всегда аккуратен, увлекается паркуром, любит играть в настольный теннис, увлечен компьютерными играми, сферой информационных технологий."  
                        },
                        {
                          id: 2,
                          img: "Mariya.png",
                          name: "Мария, 2004 г.р.",
                          text: "Общительная, любит поэзию, по своему выбору читает наизусть стихи, спортивная, занималась танцами, окончила музыкальную школу по направлениям: фортепиано и академический вокал.  Хорошо рисует, умеет вязать."  
                        },
                        {
                          id: 3,
                          img: "Ekaterina.png",
                          name: "Екатерина, 2006 г.р.",
                          text: "Любознательная, ответственная. Любит маленьких детей. Помогает воспитателю присматривать за младшими воспитанниками. Любит петь, хорошо рисует, активно участвует в различных мероприятиях, конкурсах."  
                        },
                    ]
                },
                {
                    id: 7,
                    infoblock: [
                        {
                          id: 1,
                          img: "Polina.png",
                          name: "Полина, 2007 г.р.",
                          text: "Полина со взрослыми контакт устанавливает без трудностей. С удовольствием нянчиться с маленькими детьми. Любит играть в компьютерные игры."  
                        },
                        {
                          id: 2,
                          img: "Diana.png",
                          name: "Диана, 2004 г.р.",
                          text: "Доброжелательная, спокойная; на замечания реагирует адекватно, любит трудиться, она выполняет все поручения; в отношении со взрослыми и учителями ведет себя корректно, уважительно.  После школы хочет поступать в медучилище."  
                        },
                        {
                          id: 3,
                          img: "Anton.png",
                          name: "Антон, 2005 г.р.",
                          text: "Спокойный, общительный парень. Со взрослыми разговаривает уважительно, со сверстниками не конфликтует. Обучается в школе для детей с девиантным поведением."  
                        },
                    ]
                },
                {
                    id: 8,
                    infoblock: [
                        {
                          id: 1,
                          img: "Pavel.png",
                          name: "Павел, 2005 г.р.",
                          text: "Добрый, старательный, внимательный, любознательный, занимается ипотерапией, любит смотреть фильмы – сказки. Посещает МБОУ СКОШ VIII вида."  
                        },
                        {
                          id: 2,
                          img: "Elizaveta.png",
                          name: "Елизавета, 2006 г.р.",
                          text: "Добрая, уравновешенная, отзывчивая, общительная девочка, имеет в классе друзей.С окружающими легко вступает в контакт. К взрослым относится уважительно. На замечания взрослых реагирует адекватно, выполняет все поручения."  
                        },
                        {
                          id: 3,
                          img: "Vyacheslav.png",
                          name: "Вячеслав, 2016 г.р. (брат Савелия, 2014 г.р.)",
                          text: "Доброжелательный, любопытный, общительный, трудолюбивый, подвижный, исполнительный мальчик. Любит мастерить поделки, рисовать, играть в настольные игры. Хороший помощник.  Принимает активное участие во всех мероприятиях. С удовольствием катается на велосипеде, играет в футбол."  
                        },
                    ]
                },

            ],
        }
    }
}
</script>